%Листинг №22
%Проверка неравенства Макмиллана применительно к
%азбука Морзе
%Очищаем рабочее пространство
clear, clc
%Определяем алфавит из букв русского алфавита для
%азбуки Морзе
A={'а';'б';'в';'г';'д';'е(ё)';'ж';'з';'и';...
 'й';'к';'л';'м';'н';'о';'п';'р';'с';'т';...
 'у';'ф';'х';'ц';'ч';'ш';'щ';'ъ';'ы';'ь';...
 'э';'ю';'я'};
%Вводим кодировку азбуки Морзе
Code_A={'01';'1000';'011';'100';'100';'0';'0001';'1100';...
 '00';'0111';'101';'0100';'11';'10';'111';'0110';'010';...
 '000';'1';'001';'0010';'0000';'1010';'1110';'1111';...
 '1101';'11011';'1011';'1001';'00100';'0011';'0101'};
%Выводим итоговую таблицу букв русского алфавита и
%соответствующих кодов азбуки Морзе
T=table(A,Code_A)
%Подсчитываем и выводим левую часть неравенства Макмиллана
McMillan=sym('0');
for i=1:32
    McMillan=McMillan+1/(2^strlength(string(Code_A(i))));
end
McMillan 