%Листинг №16
%Строим таблицу истинности
%Очищаем рабочее пространство
clear, clc
%Определяем функцию "Стрелка Пирса"

pa=@(x,y)((~x)&(~y));
%Определяем функцию "штрих Шеффера"
shs=@(x,y)((~x)|(~y));

impl = @(x,y)((~x)| y);

%Определяем искомую функцию
f=@(x,y,z,u)( (x) & (pa(y,z)) | ( impl((x&u) , (shs(y,z))) ) | ( (~x)&(z)&(~u) ) );
%Определяем наборы переменных
X=[0,0,0,0;0,0,0,1;0,0,1,0;0,0,1,1;...
 0,1,0,0;0,1,0,1;0,1,1,0;0,1,1,1;...
 1,0,0,0;1,0,0,1;1,0,1,0;1,0,1,1;...
 1,1,0,0;1,1,0,1;1,1,1,0;1,1,1,1];
%Вычисляем значения функции
for i=1:16
    F(i)=f(X(i,1),X(i,2),X(i,3),X(i,4));
end
%Строим таблицу истинности искомой формулы
F=F'; T=table(X,F)
