%Построение графиков алгебраической операции
%Очищаем рабочее пространство
clear, clc
%Определяем число графически построенных операций
K=25;
%Запускаем цикл построения операций в виде графиков
hold on
for k=1:K
    %Задаем пару случайных параметров n и m
    n=3*rand; m=3*rand;
    %Рисуем график операции
    fplot(@(x) f_n_m(x,n,m),[0.0, 1.0]);
end
title('$$ \frac{(n+m)^{\frac{n+m}{n}}}{nm^{\frac{m}{n}}}(1-x^n)x^m $$','interpreter','latex');

function v  = f_n_m(x,n,m)

    v = ((n+m)^((n+m)/n))/(n*(m^(m/n)))*(1-x^n)*x^m;

end